Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/OmegaT_ESP32-level2.tmx
Source language: en_us
Languages: it_it

source: Most of the time, your phone connects to your home Wi-Fi network, which is provided by your router.
it_it: Il più delle volte, il telefono si connette alla rete Wi-Fi domestica, fornita dal router.

source: Most of these digital GPIOs can be configured with internal pull-up or pull-down, or set to high impedance.
it_it: La maggior parte di questi GPIO digitali può essere configurata con pull-up o pull-down interno, oppure impostata su alta impedenza.

source: Most people associate the ESP family of microcontrollers with WiFi, which makes sense, as they’ve become the go-to solution for getting your project online quickly and easily.
it_it: La maggior parte delle persone associa la famiglia di microcontrollori ESP al WiFi, il che è comprensibile, dato che sono diventati la soluzione ideale per mettere online i propri progetti in modo rapido e semplice.

source: Much of this code is similar to the previous example.
it_it: Gran parte di questo codice è simile all'esempio precedente.

source: Multiplexed I/Os
it_it: I/O multiplexati

source: NOT Mandatory
it_it: NON Obbligatorio

source: Name
it_it: Nome

source: Next block of code creates a toggle switch.
it_it: Il blocco di codice successivo crea uno switch.

source: Next, UUIDs for the Service and the Characteristic are defined.
it_it: Successivamente, vengono definiti gli UUID per il Servizio e la Caratteristica.

source: Next, a new service for our server is created with the previously defined UUID.
it_it: Successivamente, viene creato un nuovo servizio per il server con l'UUID definito in precedenza.

source: Next, an object of the AsyncWebServer class named server is created.
it_it: Successivamente, viene creato un oggetto della classe AsyncWebServer denominato server .

source: Next, an object of the BluetoothSerial class, named SerialBT , is created.
it_it: Successivamente, viene creato un oggetto della classe BluetoothSerial, denominato SerialBT .

source: Next, launch a web browser and navigate to the IP address displayed on the serial monitor.
it_it: Avviare quindi un browser web e accedere all'indirizzo IP visualizzato sul monitor seriale.

source: Next, take two LEDs and connect their longer legs (anodes) to GPIO 4 and GPIO 5 on the ESP32.
it_it: Successivamente, si prendono due LED e se ne collegano i piedini più lunghi (anodi) ai GPIO 4 e 5 dell'ESP32.

source: Next, the network credentials (SSID and password) are specified, which you should replace with your own Wi-Fi network credentials.
it_it: Successivamente, vengono specificate le credenziali di rete (SSID e password), che vanno sostituite con le proprie.

source: Next, the service is started so that it can respond to incoming requests.
it_it: Successivamente, il servizio viene avviato in modo che possa rispondere alle richieste in arrivo.

source: Next, they print a message to the Serial Monitor so you can see the change happening.
it_it: Infine, visualizzano un messaggio sul monitor seriale in modo che sia possibile visualizzare la modifica in corso.

source: Next, we add the main heading for the web page.
it_it: Successivamente, aggiungiamo l'intestazione principale della pagina web.

source: Next, we define which GPIO pin on the ESP32 is connected to the data wire of the sensor.
it_it: Successivamente, definiamo quale pin GPIO dell'ESP32 è collegato al cavo dati del sensore.

source: Next, we set up a global variable called Temperature .
it_it: Successivamente, impostiamo una variabile globale chiamata Temperature .

source: Next, we tell our web server what to do when certain URLs are visited.
it_it: Successivamente, diciamo al server web cosa fare quando vengono visitati determinati URL.

source: Next, we’ll move on to a more advanced project.
it_it: Successivamente, passeremo a un progetto più avanzato.

source: No problem.
it_it: Nessun problema.

source: No.
it_it: N.

source: Not all of the chip pins are exposed to the pin headers.
it_it: Non tutti i pin del chip sono esposti ai connettori.

source: Not every ESP32 development board exposes every pin, but each pin works exactly the same no matter which development board you use.
it_it: Non tutte le schede di sviluppo ESP32 espongono tutti i pin, ma ogni pin funziona esattamente allo stesso modo, indipendentemente dalla scheda di sviluppo utilizzata.

source: Note that modifying ``sdkconfig`` or ``sdkconfig.h`` files found in the arduino-esp32 project tree **does not** result in changes to these options.
it_it: Si noti che la modifica dei file ``sdkconfig`` o ``sdkconfig.h`` presenti nell'albero del progetto Arduino-esp32 **non** comporta modifiche a queste opzioni.

source: Note that the PROGMEM macro is used, which stores the content in the ESP32’s program memory (flash memory) rather than the SRAM, to optimize memory.
it_it: Si noti che viene utilizzata la macro PROGMEM, che memorizza il contenuto nella memoria di programma dell'ESP32 (memoria flash) anziché nella SRAM, per ottimizzare la memoria.

source: Note that the placeholders come into play when a client connects to the ESP32 for the very first time.
it_it: Si noti che i segnaposto entrano in gioco quando un client si connette all'ESP32 per la prima volta.

source: Note that this method returns a Boolean value, indicating whether the initialization succeeded or not.
it_it: Si noti che questo metodo restituisce un valore booleano, che indica se l'inizializzazione è riuscita o meno.

source: Note:
it_it: Nota:

source: Notes
it_it: Note

source: Now click on the Login button and browser will display an upload form
it_it: Ora cliccare sul pulsante Login e il browser visualizzerà una form di caricamento.

source: Now here’s the cool part.
it_it: Ora arriva la parte interessante.

source: Now let’s go over those custom functions we linked to specific web addresses using server.on() .
it_it: Ora esaminiamo le funzioni personalizzate che abbiamo collegato a specifici indirizzi web utilizzando server.on() .

source: Now let’s go step by step through the code so you can understand how everything works-and later, you’ll be able to modify it for your own cool projects.
it_it: Ora esaminiamo il codice passo dopo passo, così si potrà capire come funziona il tutto e, in seguito, si potrà modificarlo per i propri fantastici progetti.

source: Now let’s go step by step through the code so you can understand how everything works.
it_it: Ora analizziamo il codice passo dopo passo, così si può capire come funziona il tutto.

source: Now let’s program the ESP32 so that it can communicate with our smartphone and exchange data with it.
it_it: Ora programmiamo l'ESP32 in modo che possa comunicare con lo smartphone e scambiare dati con esso.

source: Now navigate to Tools > Board > Boards Manager...
it_it: Ora si va su "Tools > Board > Boards Manager..."

source: Now open web browser and enter the url, i.e. http://esp32.local.
it_it: Ora aprire il browser web e inserire l'URL, ad esempio http://esp32.local.

source: Now select your board in the Tools > Board menu (in our case, it’s the DOIT ESP32 DEVKIT V1).
it_it: Ora si seleziona la propria scheda nel menù Tools > Board (nel nostro caso, è la "DOIT ESP32 DEVKIT V1").

source: Now that we understand the basics of web servers and how the ESP32 can operate in different Wi-Fi modes, let’s put that knowledge to use in a fun and practical project.
it_it: Ora che abbiamo compreso le basi dei server web e come l'ESP32 può funzionare in diverse modalità Wi-Fi, mettiamo in pratica queste conoscenze in un progetto divertente e pratico.

source: Now that you have learned about the Bluetooth Low Energy (BLE) wireless communication protocol, including its features, profiles, and how it communicates with devices, it’s time to give it a try.
it_it: Ora che abbiamo imparato a conoscere il protocollo di comunicazione wireless Bluetooth Low Energy (BLE), comprese le sue caratteristiche, i profili e il modo in cui comunica con i dispositivi, è il momento di provarlo.

source: Now, as you type “on” in the input box at the bottom of the app, the relay should activate instantly.
it_it: Ora, digitando “on” nella casella di input in fondo all'app, il relè dovrebbe attivarsi immediatamente.

source: Now, grab a device like your phone or laptop that can connect to a Wi-Fi network.
it_it: Ora, si prende un dispositivo come il telefono o laptop in grado di connettersi a una rete Wi-Fi.

source: Now, grab a device like your phone or laptop that’s connected to the same Wi-Fi network as your ESP32.
it_it: Ora, si prende un dispositivo come il telefono o laptop connesso alla stessa rete Wi-Fi dell'ESP32.

source: Now, grab a device like your phone, tablet, or computer-anything connected to the same Wi-Fi network-and open a web browser.
it_it: Ora, si prende un dispositivo come il telefono, tablet o computer (qualsiasi dispositivo connesso alla stessa rete Wi-Fi) e si apre un browser web.

source: Now, grab your phone or tablet and navigate to the same IP address, making sure it’s connected to the same network as your computer.
it_it: Ora, col telefono o il tablet e si accede allo stesso indirizzo IP, assicurandosi che sia connesso alla stessa rete.

source: Now, let’s consider another scenario with your smartphone.
it_it: Ora, consideriamo un altro scenario con lo smartphone.

source: Now, let’s talk about the createHTML() function.
it_it: Ora, parliamo della funzione createHTML() .

source: Now, press the EN button to restart the ESP32 and run the newly uploaded sketch.
it_it: Ora, si preme il pulsante EN per riavviare l'ESP32 ed eseguire lo sketch appena caricato.

source: Now, we need to handle what happens when the WebSocket receives data from the server, i.e. when the onmessage event fires.
it_it: Ora dobbiamo gestire cosa succede quando il WebSocket riceve dati dal server, ovvero quando si attiva l'evento onmessage .

source: Now, while keeping an eye on the URL, click the button for LED1.
it_it: Ora, tenendo d'occhio l'URL, cliccare sul pulsante per LED1.

source: Number of Channels
it_it: Numero di Canali

source: OTA Web Update
it_it: Aggiornamento Web OTA

source: OTAWebUpdate is done with a web browser that can be useful in the following typical scenarios:
it_it: OTAWebUpdate viene eseguito tramite un browser web, il che può essere utile nei seguenti scenari tipici:

source: On most development boards with built-in USB/Serial, you don’t need to worry about the state of these pins, as the board puts them in the correct state for flashing or boot mode.
it_it: Sulla maggior parte delle schede di sviluppo con USB/seriale integrata, non è necessario preoccuparsi dello stato di questi pin, poiché la scheda li imposta automaticamente nello stato corretto per la modalità flashing o boot.

source: On the other hand, if you need more processing power, extra memory, and features like Bluetooth, the ESP32 is the clear winner.
it_it: D'altra parte, se si necessita di maggiore potenza di elaborazione, memoria extra e funzionalità come il Bluetooth, l'ESP32 è il chiaro vincitore.

source: On the other hand, the Apache NimBLE-based stack is BLE only.
it_it: D'altra parte, lo stack basato su Apache NimBLE supporta solo BLE.

source: On this web page, you’ll see whether our LEDs are currently ON or OFF, and more importantly, you’ll find buttons to change their state!
it_it: Su questa pagina web, vedrete se i LED sono attualmente ACCESI o SPENTI e, cosa ancora più importante, troverete dei pulsanti per modificarne lo stato!

source: On top of that, the connection stays alive until either the client or the server closes it, allowing for continuous communication between them.
it_it: Inoltre, la connessione rimane attiva finché il client o il server non la chiudono, consentendo una comunicazione continua tra i due.

source: On-board 3.3V 600mA regulator
it_it: Regolatore da 3,3 V e 600 mA integrato

source: On-board Switches & LED Indicators
it_it: Switch e indicatori LED integrati

source: Once a connection is established between a peripheral and a central device, the advertising process stops and GATT comes into play, allowing communication to occur in both directions.
it_it: Una volta stabilita una connessione tra un dispositivo Periferico e un dispositivo Centrale, il processo di pubblicità si interrompe e entra in gioco il GATT, consentendo la comunicazione in entrambe le direzioni.

source: Once connected, the router gives the ESP32 its own IP address.
it_it: Una volta connesso, il router assegna all'ESP32 il proprio indirizzo IP.

source: Once downloaded, in your Arduino IDE, navigate to Sketch > Include Library > Add .ZIP Library and select the libraries you’ve just downloaded.
it_it: Una volta scaricate, nell'IDE di Arduino, si va su "Sketch > Include Library > Add .ZIP Library" e selezionano le librerie appena scaricate.

source: Once entered, browser should display a form
it_it: Una volta inserito, il browser dovrebbe visualizzare una form

source: Once executed, the server starts listening for incoming client requests on the previously defined routes (like the root path we set up).
it_it: Una volta eseguito, il server inizia ad ascoltare le richieste del client in arrivo sulle "route" definite in precedenza (come il path radice impostato).

source: Once the ESP32 is connected to your Wi-Fi, it gets an IP address.
it_it: Una volta connesso al Wi-Fi, l'ESP32 ottiene un indirizzo IP.

source: Once the application developed and loading directly from Arduino IDE is inconvenient or not possible
it_it: Una volta sviluppata l'applicazione, il caricamento diretto dall'IDE di Arduino risulta scomodo o impossibile

source: Once the complete HTML code is put together, it’s sent back to the server.send() function, which then delivers it to your browser.
it_it: Una volta assemblato, il codice HTML completo viene inviato alla funzione server.send() , che lo invia al browser.

source: Once the connection is established, several events are fired on the WebSocket instance on the client side.
it_it: Una volta stabilita la connessione, vengono attivati ​​diversi eventi sull'istanza WebSocket lato client.

source: Once the temperature conversion is done, we call sensors.getTempCByIndex(deviceIndex) to read the temperature from the sensor.
it_it: Una volta completata la conversione della temperatura, chiamiamo sensors.getTempCByIndex(deviceIndex) per leggere la temperatura dal sensore.

source: Once the websocket connection is established, JavaScript takes care of all the updating.
it_it: Una volta stabilita la connessione al websocket, JavaScript si occupa di tutti gli aggiornamenti.

source: Once you are comfortable with this procedure, go ahead and modify OTAWebUpdater.ino sketch to print some additional messages and compile it.
it_it: Una volta acquisita familiarità con questa procedura, modificare lo sketch OTAWebUpdater.ino per visualizzare alcuni messaggi aggiuntivi e compilarlo.

source: Once you are done with the wiring, try the below sketch.
it_it: Una volta completato il cablaggio, provare lo schema seguente.

source: Once you have uploaded the sketch, open the serial monitor at baud rate 115200 and press the EN button on the ESP32.
it_it: Dopo aver caricato lo sketch, aprire il Monitor Seriale a 115200 baud rate e premere il pulsante EN sull'ESP32.

source: Once you have uploaded the sketch, open the serial monitor at baud rate 115200 and press the EN button.
it_it: Dopo aver caricato lo sketch, aprire il Monitor Seriale a 115200 baud rate e premere il pulsante EN.

source: Once you have uploaded the sketch, open the serial monitor at baud rate 115200.
it_it: Una volta caricato lo sketch, aprire il monitor seriale a 115200 baud rate.

source: Once your computer knows the IP address of the web server, it sends a message to that server.
it_it: Una volta che il computer conosce l'indirizzo IP del server web, invia un messaggio a quel server.

source: Once your device is connected to the ESP32’s Wi-Fi network, open a web browser and type 192.168.1.1 into the address bar.
it_it: Una volta che il dispositivo è connesso alla rete Wi-Fi dell'ESP32, aprire un browser web e digitare 192.168.1.1 nella barra degli indirizzi.

source: Once you’ve finished the preceding steps, you are ready to test your first program with your ESP32!
it_it: Una volta completati i passaggi precedenti, si è pronti per testare il primo programma con l'ESP32!

source: Once you’ve made these changes, go ahead and upload the sketch to your ESP32.
it_it: Una volta apportate queste modifiche, si carica lo sketch sull'ESP32.

source: Once you’ve set those, go ahead and upload the sketch to your ESP32.
it_it: Una volta impostati questi parametri, caricare lo sketch sull'ESP32.

source: Once you’ve updated the Wi-Fi details, go ahead and upload the sketch.
it_it: Dopo aver aggiornato i dettagli del Wi-Fi, si carica lo sketch.

source: One of the advantages of the ESP32 is that it has a lot more GPIOs than the ESP8266.
it_it: Uno dei vantaggi dell'ESP32 è che ha molti più GPIO rispetto all'ESP8266.

source: One of the most exciting features of the ESP32 is its ability to run as a standalone web server-no need for an external computer or server!
it_it: Una delle caratteristiche più interessanti dell'ESP32 è la sua capacità di funzionare come server web autonomo, senza bisogno di un computer o di un server esterno!

source: One of the most useful features of the ESP32 is its ability to not only connect to an existing Wi-Fi network, but also to create its own network, allowing other devices to connect directly to it.
it_it: Una delle caratteristiche più utili dell'ESP32 è la sua capacità non solo di connettersi a una rete Wi-Fi esistente, ma anche di creare una propria rete, consentendo ad altri dispositivi di connettersi direttamente.

source: One simple way to implement this is to make the entire webpage reload itself automatically after a certain amount of time.
it_it: Un modo semplice per implementarlo è fare in modo che l'intera pagina web si ricarichi automaticamente dopo un certo periodo di tempo.

source: Only VSPI and HSPI are usable SPI interfaces, and the third SPI bus is used by the integrated flash memory chip.
it_it: Solo VSPI e HSPI sono interfacce SPI utilizzabili, mentre il terzo bus SPI è utilizzato dal chip di memoria flash integrato.

source: Open Boards Manager from Tools > Board menu and install *esp32* platform (and do not forget to select your ESP32 board from Tools > Board menu after installation).
it_it: Aprire Boards Manager dal menù Tools > Board e installare la piattaforma *esp32* (e non dimenticare di selezionare la board ESP32 dal menù Tools > Board dopo l'installazione).

source: Open Terminal and execute the following command (copy -> paste and hit enter):
it_it: Aprire il Terminal ed eseguire il seguente comando (copy -> paste e poi enter):

source: Open ``[ARDUINO_SKETCHBOOK_DIR]/hardware/espressif/esp32/tools`` and double-click ``get.exe``
it_it: Aprire ``[ARDUINO_SKETCHBOOK_DIR]/hardware/espressif/esp32/tools`` e doppio-click su ``get.exe``

source: Open a web browser (like Chrome or Firefox) and type in the IP address that appeared in the Serial Monitor.
it_it: Si apre un browser web (come Chrome o Firefox) e si digita l'indirizzo IP visualizzato nel Monitor Seriale.

source: Open a web browser (like Chrome or Firefox) and type in the IP address that showed up on the Serial Monitor.
it_it: Aprire un browser web (come Chrome o Firefox) e digitare l'indirizzo IP visualizzato sul Monitor Seriale.

source: Open the Library Manager again.
it_it: Aprire nuovamente "Library Manager".

source: Open your Arduino IDE, and go to File > Examples > BluetoothSerial > SerialtoSerialBT.
it_it: Aprire l'IDE Arduino e andare su "File > Examples > BluetoothSerial > SerialtoSerialBT".

source: Operating Temperature
it_it: Temperatura di Esercizio

source: Operating Voltage
it_it: Tensione di Esercizio

source: Operating Voltage: 2.2V to 3.6V
it_it: Tensione operativa: da 2,2 V a 3,6 V

source: Other GPIO's are `INPUT ONLY` and cannot be used as output pin:
it_it: Altri GPIO sono `INPUT ONLY` e non possono essere utilizzati come pin di uscita:

source: Other devices, like your smartphone or computer, can then search for this network and connect to it using a password you’ve set.
it_it: Altri dispositivi, come lo smartphone o il computer, possono quindi cercare questa rete e connettersi ad essa utilizzando una password impostata.

source: Our main goal for this project is to have the ESP32 control two LEDs over Wi-Fi.
it_it: L'obiettivo principale per questo progetto è far sì che l'ESP32 controlli due LED tramite Wi-Fi.

source: Over time, you may have WebSocket clients that are no longer active but still occupy resources.
it_it: Con il tempo, è possibile che alcuni client WebSocket non siano più attivi ma che continuino a occupare risorse.

source: P: Power supply; I: Input; O: Output; T: High impedance.
it_it: P: Alimentazione; I: Ingresso; O: Uscita; T: Alta impedenza.

source: PCB antenna or external antenna connector
it_it: Antenna PCB o connettore per antenna esterna

source: PWM outputs
it_it: Uscite PWM

source: PWM outputs - 25 PWM pins to control things like motor speed or LED brightness.
it_it: Uscite PWM: 25 pin PWM per controllare elementi come la velocità del motore o la luminosità dei LED.

source: PWM pins to control things like motor speed or LED brightness
it_it: Pin PWM per controllare elementi come la velocità del motore o la luminosità dei LED

source: Periodically calling the cleanClients() function from the main loop() ensures that your ESP32 is not burdened with old, unused client connections and remains efficient when handling new or active clients.
it_it: Chiamando periodicamente la funzione cleanClients() dal loop() principale, si garantisce che l'ESP32 non venga appesantito da vecchie connessioni client inutilizzate e rimanga efficiente quando gestisce client nuovi o attivi.

source: Peripheral Interface
it_it: Interfaccia Periferica

source: Peripheral Interfaces
it_it: Interfacce Periferiche

source: Peripheral devices are usually small, low-power, resource-constrained devices, such as heart rate monitors or proximity tags, that can connect to a much more powerful central device.
it_it: I dispositivi Periferici sono solitamente piccoli, a basso consumo e con risorse limitate, come cardiofrequenzimetri o tag di prossimità, che possono connettersi a un dispositivo centrale molto più potente.

source: Peripherals
it_it: Periferiche

source: Peripherals and I/O
it_it: Periferiche e I/O

source: Permissions: defines which operations on the characteristic are permitted, such as read, write, or notify.
it_it: Autorizzazioni: definiscono quali operazioni sulla caratteristica sono consentite, come lettura, scrittura o notifica.

source: Pin Layout
it_it: Layout dei Pin

source: Pins GPIO34, GPIO35, GPIO36(VP) and GPIO39(VN) cannot be configured as outputs.
it_it: I pin GPIO34, GPIO35, GPIO36(VP) e GPIO39(VN) non possono essere configurati come output.

source: Place this script just before the closing tag.
it_it: Inserire questo script appena prima del tag di chiusura di .

source: Please note that the following pinout reference is for the popular 30-pin ESP32 devkit v1 development board.
it_it: Si prega di notare che il seguente riferimento al pinout si riferisce alla popolare scheda di sviluppo ESP32 devkit v1 a 30 pin.

source: Please see :doc:`esp-idf_component` and :doc:`lib_builder` for the two solutions available.
it_it: Consultare :doc:`esp-idf_component` e :doc:`lib_builder` per le due soluzioni disponibili.

source: Please use our Jihulab mirror as the repository source:
it_it: Utilizzate il nostro mirror Jihulab come repository di sorgenti:

source: Please use our Jihulab mirror:
it_it: Utilizzare il nostro mirror Jihulab:
